{
  "title": "Revenge bedtime procrastination and 4 other things to leave in 2025",
  "send_time": "2026-01-01T06:00:00",
  "framework": "Contrarian Truth",
  "draft": "Subject: Revenge bedtime procrastination and 4 other things to leave in 2025.\n\nHook: \nMost people are setting their alarms for 5:00 AM tomorrow to 'crush it.' They’re sharpening their willpower like a dull blade. \n\nBut for you—the high-achiever who looks like they’re winning in the boardroom but feels like they’re vanishing at home—willpower is the problem, not the solution.\n\nThe Mirror:\nIf you’re reading this at midnight, or if you lying there staring at the ceiling replaying a conversation from three weeks ago, this is for you.\n\nHere are the 5 relics of 2025 we are leaving at the door tonight:\n\n1. Revenge Bedtime Procrastination: That midnight scroll isn't a 'bad habit.' It’s your nervous system grabbing sovereignty after a day of over-functioning for everyone else. Stop punishing yourself for trying to feel alive.\n2. The Conversational Autopsy: Re-living that 10-minute conflict until 3:00 AM to 'perfect' your response. Your brain is running high-fidelity threat simulations on a past that's already dead. It’s time to close the loop.\n3. The Polished Performer Mask: Being the adult in every room, the reliable leader, the 'fine' colleague—while feeling like a ghost in your own house. The mask is heavy. You don't have to carry it into 2026.\n4. Introspection Without Integration: Reading 47 books on burnout and 'understanding' your trauma, but still waking up with a racing heart on Tuesday morning. Analysis is just a sophisticated form of overthinking. You need architecture, not more insight.\n5. Toxic Resilience: Succeeding by abandoning yourself. 'Limping to the finish line' while your internal world is a construction zone with no workers.\n\nThe 2026 Shift:\nWe aren’t doing resolutions. Resolutions are for willpower. We are doing an Operating System Update. \n\n2026 is the year of Integrated Success. Where the person in the boardroom is the same person at the dinner table—and that person isn't exhausted.\n\n5 Phrases to Leave Behind:\n* 'I just need to get through this quarter.'\n* 'I'm fine, just a bit tired.'\n* 'I'll focus on my own alignment once the team is stable.'\n* 'Why can't I just be normal?'\n* 'I'll sleep when I'm dead.'\n\nNew Year Wish:\nHappy New Year. You’ve carried enough. 2026 is the year we build the architecture that holds you up, instead of you holding everything else.\n\nTeaser:\nTomorrow morning at 6 AM, I’m sending you the Q1 2026 Forecast: why 'Architecture Hunger' is going to hit you in February, and how to build a system that actually survives your hardest weeks.\n\nTalk then,\n\n[Your Name]"