{
  "title": "Revenge bedtime procrastination and 4 other things to leave in 2025",
  "send_time": "2026-01-01T06:00:00",
  "framework": "Contrarian Truth",
  "draft": "Happy New Year {{contact.name}},

There’s a quote people love to misattribute to Ali:

“It isn’t the mountains ahead that wear you out. It’s the pebble in your shoe.”

But the truth? That line’s older than Ali. It showed up in anonymous newsletters as early as 1916.

No author.
No origin.
It just… survived. Passed along from one exhausted person to another.

Because even if we couldn’t name it, we knew what it meant.

And sitting here on the first day of 2026—thinking about you, and a handful of high-performing clients I helped get out of their own way to thrive in 2025—this line hits different.

You've got this mountain climbing thing in the bag.
You’ve been climbing those your whole life:

The pressure.
The goals.
The expectations.
The emotional labor of keeping everything upright when no one knows how much it costs you.

What drained you in 2025 wasn’t the mountain.

It was the damn pebble.

The quiet, daily friction that never shows up on your calendar.
The emotional weight that doesn’t get tracked in any app.
The inner monologue that never let your nervous system go off duty.

Those mfs don't get to come with you into 2026.

Five pebbles worth leaving in 2025

1. Revenge Bedtime Procrastination
That midnight scroll is an adaptation.
It’s your nervous system grabbing sovereignty after a day of over-functioning for everyone else.
It’s not about sleep. It’s about autonomy.
New mantra: I deserve time that’s actually mine.

2. The Conversational Autopsy
Re-living that ten-minute interaction until the early hours of the morning.
Not to learn anything new.
But to soothe the part of you that’s scanning for social risk and unresolved tension.
Your mind stays alert because it doesn’t feel finished yet.
New mantra: I let moments complete.

3. The Polished Performer Split
Being the adult in every room. The reliable one. The one who’s “fine.”
At work. At home. With family.
Even when your inner life feels increasingly disconnected from the role you keep playing.
New mantra: I don’t abandon myself to meet expectations.

4. The Deferred Self Loop
“I’ll focus on myself once this season passes.”
Once the quarter ends.
Once the family needs less.
Once everyone else is settled.
Meanwhile, you keep absorbing pressure so others can function.
New mantra: My needs are not optional.

5. The Quiet Self-Indictment
“If this still feels hard, maybe I’m the problem.”
That thought shows up when you’re competent, responsible, and still exhausted.
So instead of questioning the load, you question yourself.
New mantra: I stop making exhaustion mean something about who I am.

These are not dramatic problems. That’s what makes them dangerous.
They don’t scream. They don’t announce themselves.
They just take… quietly.

And if you’ve been carrying them, you’ve been paying a tax you never agreed to.

2026 doesn’t need a new resolution...
Or a vision board.
Or more willpower.
You don’t need more grind.
You need less friction.

The mountains aren’t going anywhere.
That doesn’t mean this year has to feel like a quieter form of self-abandonment.

Lose the pebble. Let the climb be gentler.

End of note,

Drs. Mani and Charlice and the team at Mosaeic

P.S. If the conversational autopsy is the pebble that hits closest to home, I created a simple 3-step Replay Loop Breaker you can use the very next time a moment won’t let go.

Just reply “no replay” and I’ll send it to you."
}